mbed-ce/mbed-os/targets/TARGET_STM/TARGET_STM32F4/clock_cfg/TARGET_STM32F4_168_180MHZ/system_clock.c
/* mbed Microcontroller Library
 * SPDX-License-Identifier: BSD-3-Clause
 ******************************************************************************
 *
 * Copyright (c) 2015-2021 STMicroelectronics.
 * Copyright (c) 2026 MbedCE Contributors.
 * All rights reserved.
 *
 * This software component is licensed by ST under BSD 3-Clause license,
 * the "License"; You may not use this file except in compliance with the
 * License. You may obtain a copy of the License at:
 *                        opensource.org/licenses/BSD-3-Clause
 *
 ******************************************************************************
 */

/**
  * This file configures the system clock as follows:
  *-----------------------------------------------------------------------------------
  * System clock source   | 1- USE_PLL_HSE_EXTC (external clock)       |
  *                       | 2- USE_PLL_HSE_XTAL (external xtal)        | DEVICE_USBDEVICE=1
  *                       | 3- USE_PLL_HSI (internal 16 MHz clock)     |
  *-----------------------------------------------------------------------------------
  * SYSCLK(MHz)           |                               180          | 168
  * AHBCLK (MHz)          |                               180          | 168
  * APB1CLK (MHz)         |                                45          |  42
  * APB2CLK (MHz)         |                                90          |  84
  * USB capable (48 MHz)  |                                NO          | YES (HSI calibration needed)
  *-----------------------------------------------------------------------------------
**/

#include "stm32f4xx.h"
#include "mbed_error.h"

// guards to ensure HSE_VALUE is valid for PLL configuration
#if (HSE_VALUE < 4000000U) || (HSE_VALUE > 50000000U)
#error HSE_VALUE must be >= 4MHz and <= 50MHz for STM32F4 common clock config
#endif

#if ((HSE_VALUE % 1000000U) != 0U)
#error HSE_VALUE must be an integer multiple of 1MHz for STM32F4 common clock config
#endif

#define PLLM_HSE_CLOCK_SETTINGS (HSE_VALUE / 1000000U)

// clock source is selected with CLOCK_SOURCE in json config
#define USE_PLL_HSE_EXTC    0x8  // Use external clock (ST Link MCO)
#define USE_PLL_HSE_XTAL    0x4  // Use external xtal (X3 on board - not provided by default)
#define USE_PLL_HSI         0x2  // Use HSI internal clock

#if !DEVICE_USBDEVICE && (RCC_MAX_FREQUENCY > 168000000U)
#define STM32F4_168_180_SYSCLK   180000000U
#else
#define STM32F4_168_180_SYSCLK   168000000U
#endif

#define STM32F4_168_180_HSE_PLLN ((STM32F4_168_180_SYSCLK / 1000000U) * 2U)
#define STM32F4_168_180_HSI_PLLN  (STM32F4_168_180_SYSCLK / 1000000U)

#if ( ((CLOCK_SOURCE) & USE_PLL_HSE_XTAL) || ((CLOCK_SOURCE) & USE_PLL_HSE_EXTC) )
uint8_t SetSysClock_PLL_HSE(uint8_t bypass);
#endif /* ((CLOCK_SOURCE) & USE_PLL_HSE_XTAL) || ((CLOCK_SOURCE) & USE_PLL_HSE_EXTC) */

#if ((CLOCK_SOURCE) & USE_PLL_HSI)
uint8_t SetSysClock_PLL_HSI(void);
#endif /* ((CLOCK_SOURCE) & USE_PLL_HSI) */


/**
  * @brief  Configures the System clock source, PLL Multiplier and Divider factors,
  *               AHB/APBx prescalers and Flash settings
  * @note   This function should be called only once the RCC clock configuration
  *         is reset to the default reset state (done in SystemInit() function).
  * @param  None
  * @retval None
  */

MBED_WEAK void SetSysClock(void)
{
#if ((CLOCK_SOURCE) & USE_PLL_HSE_EXTC)
    /* 1- Try to start with HSE and external clock */
    if (SetSysClock_PLL_HSE(1) == 0)
#endif
    {
#if ((CLOCK_SOURCE) & USE_PLL_HSE_XTAL)
        /* 2- If fail try to start with HSE and external xtal */
        if (SetSysClock_PLL_HSE(0) == 0)
#endif
        {
#if ((CLOCK_SOURCE) & USE_PLL_HSI)
            /* 3- If fail start with HSI clock */
            if (SetSysClock_PLL_HSI() == 0)
#endif
            {
                {
                    error("SetSysClock failed\n");
                }
            }
        }
    }
}

#if ( ((CLOCK_SOURCE) & USE_PLL_HSE_XTAL) || ((CLOCK_SOURCE) & USE_PLL_HSE_EXTC) )
/******************************************************************************/
/*            PLL (clocked by HSE) used as System clock source                */
/******************************************************************************/
MBED_WEAK uint8_t SetSysClock_PLL_HSE(uint8_t bypass)
{
    RCC_OscInitTypeDef RCC_OscInitStruct;
    RCC_ClkInitTypeDef RCC_ClkInitStruct;

    /* Enable Power Control clock */
    __HAL_RCC_PWR_CLK_ENABLE();

    /* The voltage scaling allows optimizing the power consumption when the device is
       clocked below the maximum system frequency, to update the voltage scaling value
       regarding system frequency refer to product datasheet. */
    __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE1);

    /* Get the Clocks configuration according to the internal RCC registers */
    HAL_RCC_GetOscConfig(&RCC_OscInitStruct);

    /* PLL could be already configured by bootlader */
    if (RCC_OscInitStruct.PLL.PLLState != RCC_PLL_ON) {

        // Enable HSE oscillator and activate PLL with HSE as source
        RCC_OscInitStruct.OscillatorType    = RCC_OSCILLATORTYPE_HSE;
        if (bypass == 0) {
            RCC_OscInitStruct.HSEState      = RCC_HSE_ON; // External xtal on OSC_IN/OSC_OUT
        } else {
            RCC_OscInitStruct.HSEState      = RCC_HSE_BYPASS; // External clock on OSC_IN
        }

        RCC_OscInitStruct.PLL.PLLState  = RCC_PLL_ON;
        RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
        RCC_OscInitStruct.PLL.PLLM      = PLLM_HSE_CLOCK_SETTINGS;  // VCO input clock = 1 MHz (HSE MHz / HSE_VALUE)
        RCC_OscInitStruct.PLL.PLLN      = STM32F4_168_180_HSE_PLLN; // VCO output clock = 336 or 360 MHz
        RCC_OscInitStruct.PLL.PLLP      = RCC_PLLP_DIV2;            // PLLCLK = 168 or 180 MHz
        RCC_OscInitStruct.PLL.PLLQ      = 7;                        // 48 MHz when SYSCLK is 168 MHz
        if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK) {
            return 0; // FAIL
        }
    }
#if (STM32F4_168_180_SYSCLK > 168000000U)
    // Activate the OverDrive to reach the 180 MHz Frequency
    if (HAL_PWREx_EnableOverDrive() != HAL_OK) {
        return 0; // FAIL
    }
#endif

    // Select PLL as system clock source and configure the HCLK, PCLK1 and PCLK2 clocks dividers
    RCC_ClkInitStruct.ClockType         = RCC_CLOCKTYPE_SYSCLK | RCC_CLOCKTYPE_HCLK | RCC_CLOCKTYPE_PCLK1 | RCC_CLOCKTYPE_PCLK2;
    RCC_ClkInitStruct.SYSCLKSource      = RCC_SYSCLKSOURCE_PLLCLK;
    RCC_ClkInitStruct.AHBCLKDivider     = RCC_SYSCLK_DIV1; // 180 or 168 MHz
    RCC_ClkInitStruct.APB1CLKDivider    = RCC_HCLK_DIV4;  //  45 or  42 MHz
    RCC_ClkInitStruct.APB2CLKDivider    = RCC_HCLK_DIV2;  //  90 or  84 MHz
    if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_5) != HAL_OK) {
        return 0; // FAIL
    }

    return 1;
}
#endif /* ((CLOCK_SOURCE) & USE_PLL_HSE_XTAL) || ((CLOCK_SOURCE) & USE_PLL_HSE_EXTC) */

#if ((CLOCK_SOURCE) & USE_PLL_HSI)
/******************************************************************************/
/*            PLL (clocked by HSI) used as System clock source                */
/******************************************************************************/
uint8_t SetSysClock_PLL_HSI(void)
{
    RCC_OscInitTypeDef RCC_OscInitStruct;
    RCC_ClkInitTypeDef RCC_ClkInitStruct;

    /* Enable Power Control clock */
    __HAL_RCC_PWR_CLK_ENABLE();

    /* The voltage scaling allows optimizing the power consumption when the device is
       clocked below the maximum system frequency, to update the voltage scaling value
       regarding system frequency refer to product datasheet. */
    __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE1);

    // Enable HSI oscillator and activate PLL with HSI as source
    RCC_OscInitStruct.OscillatorType        = RCC_OSCILLATORTYPE_HSI | RCC_OSCILLATORTYPE_HSE;
    RCC_OscInitStruct.HSIState              = RCC_HSI_ON;
    RCC_OscInitStruct.HSEState              = RCC_HSE_OFF;
    RCC_OscInitStruct.HSICalibrationValue   = RCC_HSICALIBRATION_DEFAULT;
    RCC_OscInitStruct.PLL.PLLState          = RCC_PLL_ON;
    RCC_OscInitStruct.PLL.PLLSource         = RCC_PLLSOURCE_HSI;
    RCC_OscInitStruct.PLL.PLLM              = 8;
    RCC_OscInitStruct.PLL.PLLN              = STM32F4_168_180_HSI_PLLN;
    RCC_OscInitStruct.PLL.PLLP              = RCC_PLLP_DIV2; // 168 or 180 MHz depending on MCU capability
    RCC_OscInitStruct.PLL.PLLQ              = 7;             // 48 MHz when SYSCLK is 168 MHz
    if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK) {
        return 0; // FAIL
    }

#if (STM32F4_168_180_SYSCLK > 168000000U)
    // Activate the OverDrive to reach the 180 MHz Frequency
    if (HAL_PWREx_EnableOverDrive() != HAL_OK) {
        return 0; // FAIL
    }
#endif

    /* Select PLL as system clock source and configure the HCLK, PCLK1 and PCLK2 clocks dividers */
    RCC_ClkInitStruct.ClockType         = (RCC_CLOCKTYPE_SYSCLK | RCC_CLOCKTYPE_HCLK | RCC_CLOCKTYPE_PCLK1 | RCC_CLOCKTYPE_PCLK2);
    RCC_ClkInitStruct.SYSCLKSource      = RCC_SYSCLKSOURCE_PLLCLK;
    RCC_ClkInitStruct.AHBCLKDivider     = RCC_SYSCLK_DIV1; // 180 or 168 MHz
    RCC_ClkInitStruct.APB1CLKDivider    = RCC_HCLK_DIV4;  //  45 or  42 MHz
    RCC_ClkInitStruct.APB2CLKDivider    = RCC_HCLK_DIV2;  //  90 or  84 MHz
    if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_5) != HAL_OK) {
        return 0; // FAIL
    }

    return 1;
}
#endif /* ((CLOCK_SOURCE) & USE_PLL_HSI) */
